# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
# Your code here
import sqlite3
import pandas as pd
import numpy as np
con = sqlite3.connect('data.sqlite')

## Employees and their Office (a One-to-One join)

Return a DataFrame with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [10]:
# Your code here
pd.read_sql_query('''
SELECT e.firstName, e.lastName, o.city, o.state
FROM employees e
LEFT JOIN offices o
USING (officeCode)
ORDER BY e.firstName, e.lastName
''', con).head()

  firstName lastName           city state
0      Andy   Fixter         Sydney
1   Anthony      Bow  San Francisco    CA
2     Barry    Jones         London
3     Diane   Murphy  San Francisco    CA
4  Foon Yue    Tseng            NYC    NY

## Customers and their Orders (a One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [ ]:
pd.read_sql_query('''
SELECT c.contactFirstName, c.contactLastName
FROM customers
''', con)

In [12]:
# Your code here
pd.read_sql_query('''
SELECT c.contactFirstName, c.contactLastName, o.orderNumber, o.orderDate, o.status
FROM customers c
LEFT JOIN orders 
USING (customerNumber)
ORDER BY c.contactFirstName
''', con)

DatabaseError: Execution failed on sql '
SELECT c.contactFirstName, c.contactLastName, o.orderNumber, o.orderDate, o.status
FROM customers
LEFT JOIN orders
USING (customerNumber)
ORDER BY c.contactFirstName
': no such column: c.contactFirstName

## Customers and their Payments (another One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [ ]:
# Your code here

## Orders, Order details, and Product Details (a Many-to-Many Join)

Return a DataFrame with all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [ ]:
# Your code here

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!